NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/MGM24/MGM240PA32VNA.svd
        <register>
          <name>COH2</name>
          <description>No Description</description>
          <addressOffset>0x190</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYNCTHRESHDELTA0</name>
              <description>Syncword correlation delta threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCTHRESHDELTA1</name>
              <description>Syncword correlation delta threshold</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCTHRESHDELTA2</name>
              <description>Syncword correlation delta threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCTHRESHDELTA3</name>
              <description>Syncword correlation delta threshold</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSAPEAKCHPWRTH</name>
              <description>DSA Peak Check CHpwr Threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIXEDCDTHFORIIR</name>
              <description>.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COH3</name>
          <description>No Description</description>
          <addressOffset>0x194</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>COHDSAEN</name>
              <description>DSA enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COHDSAADDWNDSIZE</name>
              <description>DSA additional window size</description>
              <bitOffset>1</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CDSS</name>
              <description>DSA Signal Selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSAPEAKCHKEN</name>
              <description>DSA Peak Checking Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSAPEAKINDLEN</name>
              <description>DSA Peak Index length</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSAPEAKCHPWREN</name>
              <description>DSA Peak Check channel power enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOGICBASEDCOHDEMODGATE</name>
              <description>Logic Based clock gate</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DYNIIRCOEFOPTION</name>
              <description>Dynamic IIR</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ONEPEAKQUALEN</name>
              <description>One Peak</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PEAKCHKTIMOUT</name>
              <description>Peak Check Time Out</description>
              <bitOffset>23</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COHDSADETDIS</name>
              <description>DSA Detection Disable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COHDSACMPLX</name>
              <description>DSA Complex</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>No Description</description>
          <addressOffset>0x198</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003B</resetMask>
          <fields>
            <field>
              <name>PRESTOP</name>
              <description>Preamble stop</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHPWRACCUCLR</name>
              <description>Channel Power Accumulation Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AFCTXLOCK</name>
              <description>Lock AFC TX compensation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AFCTXCLEAR</name>
              <description>Clear AFC TX compensation.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AFCRXCLEAR</name>
              <description>Clear AFC RX compensation.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCPROPERTIES</name>
          <description>No Description</description>
          <addressOffset>0x1A4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FF00</resetMask>
          <fields>
            <field>
              <name>STATICSYNCTHRESHEN</name>
              <description>Static Sync Threshold Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STATICSYNCTHRESH</name>
              <description>Static Sync Threshold</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIGIGAINCTRL</name>
          <description>No Description</description>
          <addressOffset>0x1A8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>DIGIGAINEN</name>
              <description>Digital Gain Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIGIGAINSEL</name>
              <description>Digital Gain Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GAINM3</name>
                  <description>GAINM3 </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM2P75</name>
                  <description>GAINM2P75</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM2P5</name>
                  <description>GAINM2P5 </description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM2P25</name>
                  <description>GAINM2P25</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM2</name>
                  <description>GAINM2 </description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM1P75</name>
                  <description>GAINM1P75</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM1P5</name>
                  <description>GAINM1P5 </description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM1P25</name>
                  <description>GAINM1P25</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM1</name>
                  <description>GAINM1 </description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM0P75</name>
                  <description>GAINM0P75</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM0P5</name>
                  <description>GAINM0P5 </description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM0P25</name>
                  <description>GAINM0P25</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM0</name>
                  <description>GAINM0 </description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP0P25</name>
                  <description>GAINP0P25</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP0P5</name>
                  <description>GAINP0P5 </description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP0P75</name>
                  <description>GAINP0P75</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP1</name>
                  <description>GAINP1 </description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP1P25</name>
                  <description>GAINP1P25</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP1P5</name>
                  <description>GAINP1P5 </description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP1P75</name>
                  <description>GAINP1P75</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP2</name>
                  <description>GAINP2 </description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP2P25</name>
                  <description>GAINP2P25</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP2P5</name>
                  <description>GAINP2P5 </description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP2P75</name>
                  <description>GAINP2P75</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP3</name>
                  <description>GAINP3 </description>
                  <value>24</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIGIGAINDOUBLE</name>
              <description>Digital Gain Doubled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIGIGAINHALF</name>
              <description>Digital Gain Halved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEC0GAIN</name>
              <description>DEC0 Gain Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSCTRL</name>
          <description>No Description</description>
          <addressOffset>0x1AC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>POSTPONESEL</name>
              <description></description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADVANCESEL</name>
              <description></description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEWWNDSEL</name>
              <description></description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WEAKSEL</name>
              <description></description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCSENTSEL</name>
              <description></description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESENTSEL</name>
              <description></description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOWCORRSEL</name>
              <description></description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT0SEL</name>
              <description></description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT1SEL</name>
              <description></description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFADCCLKSEL</name>
              <description></description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REALTIMCFE</name>
          <description>No Description</description>
          <addressOffset>0x1B4</addressOffset>
          <access>read-write</access>
          <resetValue>0x001F81F4</resetValue>
          <resetMask>0xE03FFFFF</resetMask>
          <fields>
            <field>
              <name>MINCOSTTHD</name>
              <description>Min. Cost thrshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTSCHWIN</name>
              <description>Real time CFE searching window</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTSCHMODE</name>
              <description>Real Time CFE searching mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKINGWIN</name>
              <description>Correlator size for Tracking </description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCACQWIN</name>
              <description>SYNC Correlator Size  </description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTENSCHBYP</name>
              <description>Bypass extending Search Time</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINEWEN</name>
              <description>Enable SINE WEIGHT</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VTAFCFRAME</name>
              <description>Viterbi AFC FRAME Mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCFEEN</name>
              <description>TRECS Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETSCTRL</name>
          <description>No Description</description>
          <addressOffset>0x1B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFF7FF</resetMask>
          <fields>
            <field>
              <name>ETSLOC</name>
              <description>Early Time Stamp Location</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPSIGONPRS</name>
              <description>Capture Signal On PRS</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTRIG</name>
              <description>Trigger to capture</description>
              <bitOffset>12</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETSTIM</name>
          <description>No Description</description>
          <addressOffset>0x1BC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>ETSTIMVAL</name>
              <description>ETSTIMVAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETSCOUNTEREN</name>
              <description>ETSCOUNTEREN</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
